import numpy as np

# кількість клітин в контролі, час культивування 0 годин (початкова
# кількість клітин). 7 елементів масиву в кожній змінній тут і далі відповідають
# 7ми вимірюванням за однакових умов культивування.

control_0 = np.array(
    [
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
    ]
)


# кількість клітин в контролі, час культивування 4 години

control_4 = np.array(
    [
        1.6 * (10**7),
        1.7 * (10**7),
        1.5 * (10**7),
        1.6 * (10**7),
        1.6 * (10**7),
        1.7 * (10**7),
        1.5 * (10**7),
    ]
)


# кількість клітин в контролі, час культивування 10 годин

control_10 = np.array(
    [
        3.7 * (10**7),
        3.6 * (10**7),
        3.8 * (10**7),
        3.7 * (10**7),
        3.8 * (10**7),
        3.7 * (10**7),
        3.7 * (10**7),
    ]
)


# кількість клітин в контролі, час культивування 16 годин

control_16 = np.array(
    [
        1.04 * (10**8),
        1.06 * (10**8),
        1.08 * (10**8),
        1.07 * (10**8),
        1.06 * (10**8),
        1.06 * (10**8),
        1.05 * (10**8),
    ]
)


# кількість клітин в контролі, час культивування 22 години

control_22 = np.array(
    [
        1.3 * (10**8),
        1.2 * (10**8),
        1.4 * (10**8),
        1.2 * (10**8),
        1.4 * (10**8),
        1.2 * (10**8),
        1.1 * (10**8),
    ]
)


# кількість клітин в контролі, час культивування 28 годин

control_28 = np.array(
    [
        1.18 * (10**8),
        1.20 * (10**8),
        1.19 * (10**8),
        1.18 * (10**8),
        1.19 * (10**8),
        1.20 * (10**8),
        1.19 * (10**8),
    ]
)


# кількість клітин при культивуванні в магнітному полі, час культивування 0
# годин

mf_0 = np.array(
    [
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
    ]
)


# кількість клітин при культивуванні в магнітному полі, час культивування 4
# години

mf_4 = np.array(
    [
        1.8 * (10**7),
        1.9 * (10**7),
        2.0 * (10**7),
        1.8 * (10**7),
        1.9 * (10**7),
        2.0 * (10**7),
        1.9 * (10**7),
    ]
)


# кількість клітин при культивуванні в магнітному полі, час культивування
# 10 годин

mf_10 = np.array(
    [
        5.1 * (10**7),
        4.9 * (10**7),
        5.0 * (10**7),
        5.1 * (10**7),
        4.9 * (10**7),
        5.0 * (10**7),
        5.0 * (10**7),
    ]
)


# кількість клітин при культивуванні в магнітному полі, час культивування
# 16 годин

mf_16 = np.array(
    [
        1.3 * (10**8),
        1.1 * (10**8),
        1.2 * (10**8),
        1.3 * (10**8),
        1.3 * (10**8),
        1.2 * (10**8),
        1.2 * (10**8),
    ]
)


# кількість клітин при культивуванні в магнітному полі, час культивування
# 22 години

mf_22 = np.array(
    [
        1.41 * (10**8),
        1.42 * (10**8),
        1.43 * (10**8),
        1.40 * (10**8),
        1.39 * (10**8),
        1.41 * (10**8),
        1.42 * (10**8),
    ]
)


# кількість клітин при культивуванні в магнітному полі, час культивування
# 28 годин

mf_28 = np.array(
    [
        1.38 * (10**8),
        1.37 * (10**8),
        1.39 * (10**8),
        1.40 * (10**8),
        1.39 * (10**8),
        1.41 * (10**8),
        1.39 * (10**8),
    ]
)

# кількість клітин при культивуванні з додаванням хелату заліза, час
# культивування 0 годин

chelate_0 = np.array(
    [
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
    ]
)


# кількість клітин при культивуванні з додаванням хелату заліза, час
# культивування 4 години

chelate_4 = np.array(
    [
        1.9 * (10**7),
        1.8 * (10**7),
        2.0 * (10**7),
        2.1 * (10**7),
        1.7 * (10**7),
        1.9 * (10**7),
        1.8 * (10**7),
    ]
)


# кількість клітин при культивуванні з додаванням хелату заліза, час
# культивування 10 годин

chelate_10 = np.array(
    [
        3.8 * (10**7),
        3.7 * (10**7),
        3.9 * (10**7),
        4.0 * (10**7),
        3.8 * (10**7),
        3.9 * (10**7),
        3.9 * (10**7),
    ]
)


# кількість клітин при культивуванні з додаванням хелату заліза, час
# культивування 16 годин

chelate_16 = np.array(
    [
        1.2 * (10**8),
        1.1 * (10**8),
        1.0 * (10**8),
        1.3 * (10**8),
        0.9 * (10**8),
        1.1 * (10**8),
        1.0 * (10**8),
    ]
)


# кількість клітин при культивуванні з додаванням хелату заліза, час
# культивування 22 години

chelate_22 = np.array(
    [
        1.1 * (10**8),
        1.3 * (10**8),
        1.0 * (10**8),
        1.1 * (10**8),
        1.2 * (10**8),
        1.1 * (10**8),
        1.1 * (10**8),
    ]
)


# кількість клітин при культивуванні з додаванням хелату заліза, час
# культивування 28 годин

chelate_28 = np.array(
    [
        1.24 * (10**8),
        1.22 * (10**8),
        1.21 * (10**8),
        1.20 * (10**8),
        1.23 * (10**8),
        1.22 * (10**8),
        1.21 * (10**8),
    ]
)

# кількість клітин при культивуванні в магнітному полі та з додаванням хелату
# заліза, час культивування 0 годин

mf_chelate_0 = np.array(
    [
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
        1.1 * (10**7),
        1.0 * (10**7),
    ]
)


# кількість клітин при культивуванні в магнітному полі та з додаванням
# хелату заліза, час культивування 4 години

mf_chelate_4 = np.array(
    [
        1.8 * (10**7),
        1.7 * (10**7),
        1.8 * (10**7),
        1.9 * (10**7),
        1.7 * (10**7),
        1.8 * (10**7),
        1.9 * (10**7),
    ]
)


# кількість клітин при культивуванні в магнітному полі та з додаванням
# хелату заліза, час культивування 10 годин

mf_chelate_10 = np.array(
    [
        4.4 * (10**7),
        4.5 * (10**7),
        4.3 * (10**7),
        4.4 * (10**7),
        4.5 * (10**7),
        4.4 * (10**7),
        4.3 * (10**7),
    ]
)


# кількість клітин при культивуванні в магнітному полі та з додаванням
# хелату заліза, час культивування 16 годин

mf_chelate_16 = np.array(
    [
        1.24 * (10**8),
        1.22 * (10**8),
        1.20 * (10**8),
        1.21 * (10**8),
        1.23 * (10**8),
        1.22 * (10**8),
        1.21 * (10**8),
    ]
)


# кількість клітин при культивуванні в магнітному полі та з додаванням
# хелату заліза, час культивування 22 години

mf_chelate_22 = np.array(
    [
        1.45 * (10**8),
        1.46 * (10**8),
        1.44 * (10**8),
        1.43 * (10**8),
        1.42 * (10**8),
        1.44 * (10**8),
        1.45 * (10**8),
    ]
)


# кількість клітин при культивуванні в магнітному полі та з додаванням
# хелату заліза, час культивування 28 годин

mf_chelate_28 = np.array(
    [
        1.43 * (10**8),
        1.42 * (10**8),
        1.41 * (10**8),
        1.42 * (10**8),
        1.44 * (10**8),
        1.40 * (10**8),
        1.42 * (10**8),
    ]
)
